Xieliang0724/coffe_mcu/sdkconfig.defaults
# ESP32-C5 目标
CONFIG_IDF_TARGET="esp32c5"

# 双频 Wi-Fi (2.4G + 5G)
CONFIG_SOC_WIFI_SUPPORT_5G=y

# 闪存大小：coffe_mcu 板为 N16R8 (16MB flash, 8MB PSRAM)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# 主任务栈
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# 日志级别
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# NVS 分区
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# HTTP Server（coffe_mcu 含 12 个路由，故加大）
CONFIG_HTTPD_MAX_URI_HANDLERS=16

# 关闭功耗节省（配网期间保持响应）
CONFIG_PM_ENABLE=n

# 蓝牙：启用 BT + NimBLE（BLE-only，省内存） + BLE 控制器
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_CONTROLLER_ENABLED=y

